---
kind: property
id: P:Autodesk.Revit.DB.SpatialElement.Perimeter
source: html/e58a42f7-2311-3f25-ab30-1c2e68f6ab19.htm
---
# Autodesk.Revit.DB.SpatialElement.Perimeter Property

The perimeter.

## Syntax (C#)
```csharp
public double Perimeter { get; }
```